In [2]:
import pandas as pd

In [ ]:
# read a tab separated data file
pd.read_table('http://bit.ly/chiporders')

In [ ]:
orders= pd.read_table('https://bit.ly/chiporders')
orders.head()

In [ ]:
movies= pd.read_table("http://bit.ly/movieusers")
movies.head()

In [ ]:
movies= pd.read_table('http://bit.ly/movieusers', sep= '|')
movies.head()

In [ ]:
movies= pd.read_table('http://bit.ly/movieusers', sep= '|', header= None)
movies.head()

In [ ]:
usercols= ['user_id', 'age', 'gender', 'occupation', 'zip_code']
users= pd.read_table('http://bit.ly/movieusers', sep= '|', names= usercols)
users.head()

In [ ]:
del movies

In [ ]:
ufo= pd.read_csv('http://bit.ly/uforeports')
ufo.head()

In [ ]:
type(ufo)

In [ ]:
ufo['City']

In [ ]:
type(ufo['City'])

In [ ]:
ufo.City.head()

In [ ]:
ufo['Colors Reported'].head(20)

In [ ]:
ufo.City + ufo.State

In [ ]:
ufo['Location'] = ufo.City + ', ' + ufo.State
ufo.Location.head()

In [ ]:
ufo.head()

In [ ]:
movies= pd.read_csv('http://bit.ly/imdbratings')

In [ ]:
movies.head()

In [ ]:
movies.describe()

In [ ]:
movies.shape

In [ ]:
movies.dtypes

In [ ]:
movies.describe(include= ['object'])

In [ ]:
ufo.head()

In [ ]:
ufo.columns

In [ ]:
ufo.columns.values

In [ ]:
ufo.rename(columns= {'Colors Reported' : 'Colors_Reported', 'Shape Reported' : 'Shape_Reported'}, inplace= True)
ufo.head()

In [ ]:
ufo.columns

In [ ]:
ufo_cols = ['city', 'colours reported', 'shape reported', 'state', 'time', 'location']
ufo.columns= ufo_cols
ufo.head()

In [ ]:
ufo_cols

In [ ]:
ufo_cols[0:4]

In [ ]:
ufo= pd.read_csv('http://bit.ly/uforeports', names= ufo_cols[0:5], header= 0)
ufo.head()

In [ ]:
ufo.columns

In [ ]:
ufo.columns = ufo.columns.str.replace(' ', '_')
ufo.head()

In [ ]:
ufo= pd.read_csv('http://bit.ly/uforeports')

In [ ]:
ufo.shape

In [ ]:
ufo.head()

In [ ]:
ufo.drop('Colors Reported', axis= 1).head()

In [ ]:
ufo.head()

In [ ]:
ufo.drop('Colors Reported', axis= 1, inplace= True)
ufo.head()

In [ ]:
ufo.drop(['City','State'], axis= 1, inplace= True)
ufo.head()

In [ ]:
ufo.drop([0,1], axis= 0, inplace= True)
ufo.head()

In [ ]:
ufo.shape

In [ ]:
movies= pd.read_csv('http://bit.ly/imdbratings')
movies.head()

In [ ]:
movies.title.sort_values()

In [ ]:
movies.duration.sort_values(ascending= False)

In [ ]:
movies.head()

In [ ]:
movies.sort_values('title').head()

In [ ]:
movies.sort_values('star_rating', ascending= False, inplace= True)
movies.head(10)

In [ ]:
movies.sort_values(['content_rating', 'duration'])

In [ ]:
movies.sort_values(['content_rating', 'duration'], ascending= [True, False]).head(20)

In [ ]:
movies.head()

In [ ]:
movies.shape

In [ ]:
movies[movies.duration >= 200]

In [ ]:
movies[movies.duration >= 200].genre

In [ ]:
movies[movies.duration >= 200]['genre']

In [ ]:
movies.ix[movies.duration >= 200, ['star_rating', 'title', 'genre'] ]

In [ ]:
movies.head()

In [ ]:
movies.shape

In [ ]:
movies[(movies.duration >= 200) & (movies.genre== 'Drama')]

In [ ]:
movies[(movies.duration >= 200) | (movies.genre== 'Drama')]

In [ ]:
movies[ movies.genre.isin(['Crime', 'Drama', 'Action'])]

In [3]:
ufo= pd.read_csv("http://bit.ly/uforeports")

In [4]:
ufo.columns

Index([u'City', u'Colors Reported', u'Shape Reported', u'State', u'Time'], dtype='object')

In [5]:
ufo.head()

                   City Colors Reported Shape Reported State             Time
0                Ithaca             NaN       TRIANGLE    NY   6/1/1930 22:00
1           Willingboro             NaN          OTHER    NJ  6/30/1930 20:00
2               Holyoke             NaN           OVAL    CO  2/15/1931 14:00
3               Abilene             NaN           DISK    KS   6/1/1931 13:00
4  New York Worlds Fair             NaN          LIGHT    NY  4/18/1933 19:00

In [6]:
ufo= pd.read_csv("http://bit.ly/uforeports", usecols= ['City','State'])
print ufo.shape
ufo.head()

(18241, 2)

                   City State
0                Ithaca    NY
1           Willingboro    NJ
2               Holyoke    CO
3               Abilene    KS
4  New York Worlds Fair    NY

In [20]:
ufo= pd.read_csv("http://bit.ly/uforeports", nrows= 10)

In [21]:
print ufo.shape
ufo.head()

(10, 5)

                   City  Colors Reported Shape Reported State             Time
0                Ithaca              NaN       TRIANGLE    NY   6/1/1930 22:00
1           Willingboro              NaN          OTHER    NJ  6/30/1930 20:00
2               Holyoke              NaN           OVAL    CO  2/15/1931 14:00
3               Abilene              NaN           DISK    KS   6/1/1931 13:00
4  New York Worlds Fair              NaN          LIGHT    NY  4/18/1933 19:00

In [22]:
for c in ufo.City:
    print c

Ithaca
Willingboro
Holyoke
Abilene
New York Worlds Fair
Valley City
Crater Lake
Alma
Eklutna
Hubbard

In [23]:
for index,row in ufo.iterrows():
    print (index, row.City, row.State)

(0, 'Ithaca', 'NY')
(1, 'Willingboro', 'NJ')
(2, 'Holyoke', 'CO')
(3, 'Abilene', 'KS')
(4, 'New York Worlds Fair', 'NY')
(5, 'Valley City', 'ND')
(6, 'Crater Lake', 'CA')
(7, 'Alma', 'MI')
(8, 'Eklutna', 'AK')
(9, 'Hubbard', 'OR')

In [24]:
drinks= pd.read_csv('http://bit.ly/drinksbycountry')
drinks.head()

,country,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol,continent
0,Afghanistan,0,0,0,0.0,Asia
1,Albania,89,132,54,4.9,Europe
2,Algeria,25,0,14,0.7,Africa
3,Andorra,245,138,312,12.4,Europe
4,Angola,217,57,45,5.9,Africa

In [25]:
drinks.dtypes

country                          object
beer_servings                     int64
spirit_servings                   int64
wine_servings                     int64
total_litres_of_pure_alcohol    float64
continent                        object
dtype: object

In [26]:
import numpy as np

In [27]:
drinks.select_dtypes(include= [np.number]).head()

   beer_servings  spirit_servings  wine_servings  total_litres_of_pure_alcohol
0              0                0              0                           0.0
1             89              132             54                           4.9
2             25                0             14                           0.7
3            245              138            312                          12.4
4            217               57             45                           5.9

In [28]:
drinks.select_dtypes(include= [np.number]).dtypes

beer_servings                     int64
spirit_servings                   int64
wine_servings                     int64
total_litres_of_pure_alcohol    float64
dtype: object

In [29]:
drinks.describe()

,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol
count,193.000000,193.000000,193.000000,193.000000
mean,106.160622,80.994819,49.450777,4.717098
std,101.143103,88.284312,79.697598,3.773298
min,0.000000,0.000000,0.000000,0.000000
25%,20.000000,4.000000,1.000000,1.300000
50%,76.000000,56.000000,8.000000,4.200000
75%,188.000000,128.000000,59.000000,7.200000
max,376.000000,438.000000,370.000000,14.400000

In [30]:
drinks.describe(include= 'all')

,country,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol,continent
count,193,193.000000,193.000000,193.000000,193.000000,193
unique,193,NaN,NaN,NaN,NaN,6
top,Lesotho,NaN,NaN,NaN,NaN,Africa
freq,1,NaN,NaN,NaN,NaN,53
mean,NaN,106.160622,80.994819,49.450777,4.717098,NaN
std,NaN,101.143103,88.284312,79.697598,3.773298,NaN
min,NaN,0.000000,0.000000,0.000000,0.000000,NaN
25%,NaN,20.000000,4.000000,1.000000,1.300000,NaN
50%,NaN,76.000000,56.000000,8.000000,4.200000,NaN
75%,NaN,188.000000,128.000000,59.000000,7.200000,NaN
max,NaN,376.000000,438.000000,370.000000,14.400000,NaN

In [31]:
drinks.describe(include= ['object','float64'])

        country  total_litres_of_pure_alcohol continent
count       193                    193.000000       193
unique      193                           NaN         6
top     Lesotho                           NaN    Africa
freq          1                           NaN        53
mean        NaN                      4.717098       NaN
std         NaN                      3.773298       NaN
min         NaN                      0.000000       NaN
25%         NaN                      1.300000       NaN
50%         NaN                      4.200000       NaN
75%         NaN                      7.200000       NaN
max         NaN                     14.400000       NaN

In [32]:
drinks.describe(include= ['object'])

        country continent
count       193       193
unique      193         6
top     Lesotho    Africa
freq          1        53